tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Command-line interface for SQLite
brew "sqlite"
# Record and share terminal sessions
brew "asciinema"
# Spell checker with better logic than ispell
brew "aspell"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Generate compilation database for clang tooling
brew "bear"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Text-based window manager and terminal multiplexer
brew "byobu"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Next-gen compiler infrastructure
brew "llvm"
# C/C++/ObjC language server
brew "ccls"
# Cross-platform make
brew "cmake"
# Migemo is a tool that supports Japanese incremental search with Romaji
brew "cmigemo"
# File comparison utilities
brew "diffutils"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Image manipulation library
brew "jpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU debugger
brew "gdb"
# Colorize logfiles and command output
brew "grc"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Spell checker and morphological analyzer
brew "hunspell"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# JSON output from a shell
brew "jo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Library to render SVG files using Cairo
brew "librsvg"
# Powerful multi-lingual file viewer/grep
brew "lv"
# Java-based project management
brew "maven"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Port scanning utility for large networks
brew "nmap"
# Password manager
brew "pass"
# Monitor data's progress through a pipe
brew "pv"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Extract, view, and test RAR archives
brew "unrar"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Run Windows applications without a copy of Microsoft Windows
brew "wine"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Password manager app
cask "keepassxc"
# Create, manage and debug system- and user services
cask "launchcontrol"
# Command-line shell and scripting language
cask "powershell"
# Open-source version of the X.Org X Window System
cask "xquartz"
